Catalogs/СудебныеПриставы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СудебныеПриставы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименованиеССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уволен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТелефона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТелефонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДляПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодГорода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавочный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СудебныеПриставы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДобавитьНомерТелефона(Команда)
	ЗначенияПолей = Новый СписокЗначений();
	ЗначенияПолей.Добавить(Объект.Ссылка, "СудебныйПристав");
	//ЗначенияПолей.Добавить(Элементы.Телефоны.ТекущиеДанные.ВидТелефона, "ВидТелефона");
	//ЗначенияПолей.Добавить(Элементы.Телефоны.ТекущиеДанные.КонтактноеЛицо, "КонтактноеЛицо");
	//ЗначенияПолей.Добавить(Элементы.Телефоны.ТекущиеДанные.КодСтраны,     "КодСтраны");
	//ЗначенияПолей.Добавить(Элементы.Телефоны.ТекущиеДанные.КодГорода,     "КодГорода");
	//ЗначенияПолей.Добавить(Элементы.Телефоны.ТекущиеДанные.НомерТелефона, "НомерТелефона");
	//ЗначенияПолей.Добавить(Элементы.Телефоны.ТекущиеДанные.Добавочный,    "Добавочный");
	//ЗначенияПолей.Добавить(Элементы.Телефоны.ТекущиеДанные.Комментарий,   "Комментарий");

	
	ТекСтрока = Объект.Телефоны[Элементы.Телефоны.ТекущиеДанные.НомерСтроки - 1];
	ИмяФормыРедактирования = "Справочник.СудебныеПриставы.Форма.ВводТелефонногоНомера";
	
	Пар = Новый Структура;
	Пар.Вставить("ЗначенияПолей",                ЗначенияПолей);
	Пар.Вставить("Вид",                          ""); //"Адрес");
	Пар.Вставить("БылиВнесеныИзменения",         Ложь);
	Пар.Вставить("Представление",                "");
	Пар.Вставить("РедактированиеТолькоВДиалоге", Ложь);
	Пар.Вставить("АдресТолькоРоссийский",        Ложь);
	
	//Чуров 06042017
	//ДопПараметры  = новый Структура("Строки, Элемент", Строки, Элемент);
	Результат = ОткрытьФорму(ИмяФормыРедактирования, Пар,,,,,Новый ОписаниеОповещения("ТелефоныПриставЗавершение", ЭтаФорма, новый Структура("ТекСтрока", Неопределено)));

КонецПроцедуры

&НаКлиенте
Процедура ТелефоныПриставЗавершение(Результат, ДопПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если ДопПараметры.ТекСтрока = Неопределено Тогда
			СтрокаТелефон = Объект.Телефоны.Добавить();
		Иначе
			СтрокаТелефон = ДопПараметры.ТекСтрока;
		КонецЕсли;
		СтрокаТелефон.Номер = Результат.Представление;
		ЗначенияПолей = Результат.ЗначенияПолей;
		Модифицированность = Истина;
		Для Каждого Элемент Из ЗначенияПолей Цикл
			СтрокаТелефон[Элемент.Представление] = Элемент.Значение; 
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.ФамилияИО = СократитьИмя(Объект.Наименование);
КонецПроцедуры

&НаКлиенте
Функция СократитьИмя(СтрокаФИО)
	ИмяП = СтрокаФИО;
	ИмяП = СтрЗаменить(ИмяП,"."," ");
	ИмяП = СтрЗаменить(ИмяП,"  "," ");
	
	Если Лев(ИмяП,1) = " " Тогда
		ИмяП = Прав(ИмяП, СтрДлина(ИмяП)-1);
	КонецЕсли;
	ИмяП = СтрЗаменить(ИмяП, " ",Символы.ПС);
	ЧислоСтрок = СтрЧислоСтрок(ИмяП);
	
	Фамилия = СтрПолучитьСтроку(ИмяП,1);
	Имя = СтрПолучитьСтроку(ИмяП,2);
	Отчество = СтрПолучитьСтроку(ИмяП,3);
	
	ФамилияИнициалы = Фамилия;
	Если СтрДлина(Имя) > 0 Тогда
		ФамилияИнициалы = ФамилияИнициалы + "_" + Лев(Имя,1);
	КонецЕсли;
	
	Если СтрДлина(Отчество) > 0 Тогда
		ФамилияИнициалы = ФамилияИнициалы + "_" + Лев(Отчество,1);
	КонецЕсли;
	Возврат(ФамилияИнициалы);
КонецФункции
